In [52]:
import pandas as pd
import numpy as np

In [8]:
import pandas as pd
data = [('Meetul', 25, 123),
        ('Sanjana', 30, 456),
        ('Bumbum', 28, 789)]
columns = ['Name', 'Age', 'Number']
df = pd.DataFrame(data, columns=columns)
df

      Name  Age  Number
0   Meetul   25     123
1  Sanjana   30     456
2   Bumbum   28     789

In [9]:
data = {
    "one": ('a','b'),
    "two":(1,2)
}
df = pd.DataFrame(data)
df

  one  two
0   a    1
1   b    2

In [16]:
df.head(1)

  one  two
0   a    1

In [17]:
df.tail(1)

  one  two
1   b    2

In [20]:
df.index

RangeIndex(start=0, stop=2, step=1)

In [22]:
df.columns[1]

'two'

In [23]:
df.describe(include="all")

        one       two
count     2  2.000000
unique    2       NaN
top       a       NaN
freq      1       NaN
mean    NaN  1.500000
std     NaN  0.707107
min     NaN  1.000000
25%     NaN  1.250000
50%     NaN  1.500000
75%     NaN  1.750000
max     NaN  2.000000

In [24]:
df.T

     0  1
one  a  b
two  1  2

In [27]:
df.sort_index(ascending=True, axis=1)

  one  two
0   a    1
1   b    2

In [28]:
df.sort_values(by="one")

  one  two
0   a    1
1   b    2

In [36]:
df.loc[:,"one"]

0    a
1    b
Name: one, dtype: object

In [38]:
df.iloc[:]

  one  two
0   a    1
1   b    2

In [39]:
df[df["one"]=="a"]

  one  two
0   a    1

In [41]:
df[df["one"].isin(["a"])]

  one  two
0   a    1

In [53]:
data = {
    "name": ["meetul","sanjana","bumbum"],
    "english":[25,np.nan,36],
    "hindi":[47,45,59],
    "maths":[45,75,39],
    "social":[47,45,np.nan]
}

df = pd.DataFrame(data)
df

      name  english  hindi  maths  social
0   meetul     25.0     47     45    47.0
1  sanjana      NaN     45     75    45.0
2   bumbum     36.0     59     39     NaN

In [54]:
df.isnull().sum()

name       0
english    1
hindi      0
maths      0
social     1
dtype: int64

In [ ]:
#======merge two dataframe========